group6adhoc18/miniproject/ncp_ftd_CC1352R1_LAUNCHXL_tirtos_gcc/Debug/configPkg/package/cfg/release_pm4fg.c
/*
 * ======== ti.sysbios.family.arm.cc26xx.Boot TEMPLATE ========
 */


#include <ti/devices/DeviceFamily.h>

#include DeviceFamily_constructPath(inc/hw_types.h)



/* workaround bug in driverlib */

/*
 * ======== ti.sysbios.hal.Seconds TEMPLATE ========
 */



#if defined(__ti__)

#pragma FUNC_EXT_CALLED(time);

#define ATTRIBUTE

#elif defined(__IAR_SYSTEMS_ICC__)

#define ATTRIBUTE
#define _NO_DEFINITIONS_IN_HEADER_FILES 1
#else

#define ATTRIBUTE __attribute__ ((used))

#endif

#include <xdc/std.h>
#include <ti/sysbios/hal/Seconds.h>

#include <time.h>

/*
 *  ======== time ========
 */
time_t ATTRIBUTE time(time_t *tout)
{
    UInt32 t;

    /* Seconds_get() returns number of seconds since Jan 1, 1970 00:00:00 GMT. */
    t = ti_sysbios_hal_Seconds_get();

#if defined(__ti__)
    /*
     *  TI time() function returns seconds since 1900, so add the number
     *  of seconds from 1900 to 1970 (2208988800).
     */
    t += 2208988800;
#endif

    if (tout) {
        *tout = t;
    }

    return (t);
}

/*
 * ======== ti.sysbios.rom.ROM TEMPLATE ========
 */


/* ROM_ExternFuncPtrs */
#include <xdc/runtime/System.h>
#include <xdc/runtime/Startup.h>
#include <ti/sysbios/family/arm/cc26xx/Timer.h>
#include <ti/sysbios/family/arm/cc26xx/TimestampProvider.h>

typedef struct {
    /*
     *  functions explicitly excluded from the ROM
     */
    xdc_Int (*xdc_runtime_Startup_getState__I)(xdc_runtime_Types_ModuleId);
    xdc_Bool (*xdc_runtime_System_SupportProxy_Module__startupDone__S)(xdc_Void);
    xdc_Void (*xdc_runtime_System_SupportProxy_abort__E)(xdc_CString);
    xdc_Void (*xdc_runtime_System_SupportProxy_exit__E)( xdc_Int);
    xdc_Void (*xdc_runtime_System_SupportProxy_flush__E)(xdc_Void);
    xdc_Void (*xdc_runtime_System_SupportProxy_putch__E)( xdc_Char);
    xdc_Bool (*xdc_runtime_System_SupportProxy_ready__E)(xdc_Void);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_start__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_initDevice__I)(ti_sysbios_family_arm_cc26xx_Timer_Object *);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I)(ti_sysbios_family_arm_cc26xx_Timer_Object *, xdc_UInt32, xdc_Bool);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle, xdc_UInt32);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle);
    xdc_UInt64 (*ti_sysbios_family_arm_cc26xx_Timer_getCount64__E)(ti_sysbios_family_arm_cc26xx_Timer_Object *);
    xdc_Void (*ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E)(xdc_UArg);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E)(ti_sysbios_family_arm_cc26xx_Timer_Handle, xdc_Bool);
    xdc_UInt32 (*ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E)(xdc_Void);
    xdc_Void (*ti_sysbios_knl_Clock_workFuncDynamic__E)();
} ROM_ExternFuncPtrs;

/* xdcRomExternFuncsPtr */
#ifdef __ti__sect
#pragma DATA_SECTION(ROM_externFuncPtrs, ".const:ROM_externFuncPtrs");
#endif
#ifdef __IAR_SYSTEMS_ICC__
#pragma location = ".const_ROM_externFuncPtrs"
#endif
#ifdef __GNUC__
#ifndef __TI_COMPILER_VERSION__
const ROM_ExternFuncPtrs ROM_externFuncPtrs __attribute__ ((section(".const_ROM_externFuncPtrs")));
#endif
#endif
const ROM_ExternFuncPtrs ROM_externFuncPtrs = {
    xdc_runtime_Startup_getState__I,
    xdc_runtime_System_SupportProxy_Module__startupDone__S,
    xdc_runtime_System_SupportProxy_abort__E,
    xdc_runtime_System_SupportProxy_exit__E,
    xdc_runtime_System_SupportProxy_flush__E,
    xdc_runtime_System_SupportProxy_putch__E,
    xdc_runtime_System_SupportProxy_ready__E,
    ti_sysbios_family_arm_cc26xx_Timer_start__E,
    ti_sysbios_family_arm_cc26xx_Timer_initDevice__I,
    ti_sysbios_family_arm_cc26xx_Timer_setThreshold__I,
    ti_sysbios_family_arm_cc26xx_Timer_setNextTick__E,
    ti_sysbios_family_arm_cc26xx_Timer_getMaxTicks__E,
    ti_sysbios_family_arm_cc26xx_Timer_getCount64__E,
    ti_sysbios_family_arm_cc26xx_Timer_dynamicStub__E,
    ti_sysbios_family_arm_cc26xx_Timer_getCurrentTick__E,
    ti_sysbios_family_arm_cc26xx_TimestampProvider_get32__E,
    ti_sysbios_knl_Clock_workFuncDynamic__E,
};

/* xdcRomExternFuncsPtr */
#ifdef __ti__sect
#pragma DATA_SECTION(xdcRomExternFuncPtr, ".data:xdcRomExternFuncPtr");
#endif
#ifdef __IAR_SYSTEMS_ICC__
#pragma location = ".data_xdcRomExternFuncPtr"
#endif
#ifdef __GNUC__
#ifndef __TI_COMPILER_VERSION__
const ROM_ExternFuncPtrs *xdcRomExternFuncPtr __attribute__ ((section(".data_xdcRomExternFuncPtr")));
#endif
#endif
const ROM_ExternFuncPtrs *xdcRomExternFuncPtr = &ROM_externFuncPtrs;



/*
 * ======== ti.sysbios.rom.cortexm.cc26xx.agama.CC26xx TEMPLATE ========
 */




/* Inform CC2642.lds to reserve ROM data at 0x20000100 */
char ROM_DATA_SIZE __attribute__((section(".data")));
/* Inform CC2642.lds to reserve ROM rodata at 0x00001000 */
char ROM_RODATA_SIZE __attribute__((section(".data")));

extern unsigned int __sysbios_rom_data_load__;
extern unsigned int __sysbios_rom_data_start__;
extern unsigned int __sysbios_rom_data_end__;

extern unsigned int __sysbios_data_other_load__;
extern unsigned int __sysbios_data_other_start__;
extern unsigned int __sysbios_data_other_end__;

void ti_sysbios_rom_cortexm_cc26xx_agama_CC26xx_dataInit()
{
    unsigned int * dl;
    unsigned int * ds;
    unsigned int * de;

    dl = & __sysbios_rom_data_load__;
    ds = & __sysbios_rom_data_start__;
    de = & __sysbios_rom_data_end__;

    while (ds < de) {
        *ds = *dl;
        dl++;
        ds++;
    }

    dl = & __sysbios_data_other_load__;
    ds = & __sysbios_data_other_start__;
    de = & __sysbios_data_other_end__;

    while (ds < de) {
        *ds = *dl;
        dl++;
        ds++;
    }
}

Void ti_sysbios_rom_cortexm_cc26xx_agama_CC26xx_badRomRevision__E() {
	/* Loop here forever if application is built with wrong version of ROM image */
        while(1) {
            ;
        }
}

Void ti_sysbios_rom_cortexm_cc26xx_agama_CC26xx_checkRevision__E()
{
    if (*((UInt32 *)(268668928)) != 1146307402) {
	ti_sysbios_rom_cortexm_cc26xx_agama_CC26xx_badRomRevision__E();
    }
}


