group6adhoc18/miniproject/ncp_ftd_CC1352R1_LAUNCHXL_tirtos_gcc/Debug/configPkg/package/cfg/release_pm4fg.c
/* Module__loggerObj__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj__C = ((CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerObj)0);

/* Module__loggerFxn0__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0__C = ((CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn0)0);

/* Module__loggerFxn1__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1__C = ((CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn1)0);

/* Module__loggerFxn2__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2__C = ((CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn2)0);

/* Module__loggerFxn4__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4__C = ((CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn4)0);

/* Module__loggerFxn8__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8 ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8__C = ((CT__ti_sysbios_family_arm_cc26xx_Seconds_Module__loggerFxn8)0);

/* Object__count__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__count ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__count ti_sysbios_family_arm_cc26xx_Seconds_Object__count__C = 0;

/* Object__heap__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__heap ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__heap ti_sysbios_family_arm_cc26xx_Seconds_Object__heap__C = 0;

/* Object__sizeof__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof ti_sysbios_family_arm_cc26xx_Seconds_Object__sizeof__C = 0;

/* Object__table__C */
const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__table ti_sysbios_family_arm_cc26xx_Seconds_Object__table__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Seconds_Object__table__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Seconds_Object__table ti_sysbios_family_arm_cc26xx_Seconds_Object__table__C = 0;


/*
 * ======== ti.sysbios.family.arm.cc26xx.Timer INITIALIZERS ========
 */


/* Object__PARAMS__C */
const ti_sysbios_family_arm_cc26xx_Timer_Params ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C")));
__FAR__ const ti_sysbios_family_arm_cc26xx_Timer_Params ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C = {
    sizeof (ti_sysbios_family_arm_cc26xx_Timer_Params), /* __size */
    0, /* __self */
    0, /* __fxns */
    (xdc_runtime_IInstance_Params*)&ti_sysbios_family_arm_cc26xx_Timer_Object__PARAMS__C.__iprms, /* instance */
    ti_sysbios_interfaces_ITimer_RunMode_CONTINUOUS,  /* runMode */
    ti_sysbios_interfaces_ITimer_StartMode_AUTO,  /* startMode */
    ((xdc_UArg)0),  /* arg */
    (xdc_UInt32)0x0,  /* period */
    ti_sysbios_interfaces_ITimer_PeriodType_MICROSECS,  /* periodType */
    {
        (xdc_Bits32)0x0,  /* hi */
        (xdc_Bits32)0x0,  /* lo */
    },  /* extFreq */
    ((ti_sysbios_family_arm_m3_Hwi_Params*)0),  /* hwiParams */
    {
        sizeof (xdc_runtime_IInstance_Params), /* __size */
        0,  /* name */
    },  /* instance */
};

/* Module__root__V */
ti_sysbios_family_arm_cc26xx_Timer_Module__ ti_sysbios_family_arm_cc26xx_Timer_Module__root__V = {
    {&ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link,  /* link.next */
    &ti_sysbios_family_arm_cc26xx_Timer_Module__root__V.link},  /* link.prev */
};

/* Object__table__V */
ti_sysbios_family_arm_cc26xx_Timer_Object__ ti_sysbios_family_arm_cc26xx_Timer_Object__table__V[1] = {
    {/* instance#0 */
        0,
        1,  /* staticInst */
        (xdc_Int)0x0,  /* id */
        ti_sysbios_interfaces_ITimer_StartMode_AUTO,  /* startMode */
        (xdc_UInt32)0xa7c5,  /* period */
        ((xdc_UArg)0),  /* arg */
        ((xdc_Void(*)(xdc_UArg))((xdc_Fxn)ti_sysbios_knl_Clock_doTick__I)),  /* tickFxn */
        {
            (xdc_Bits32)0x0,  /* hi */
            (xdc_Bits32)0x10000,  /* lo */
        },  /* frequency */
        (ti_sysbios_family_arm_m3_Hwi_Handle)&ti_sysbios_family_arm_m3_Hwi_Object__table__V[0],  /* hwi */
        (xdc_UInt64)0xa7c5,  /* period64 */
        (xdc_UInt64)0x0,  /* savedCurrCount */
        (xdc_UInt64)0xa7c5,  /* prevThreshold */
        (xdc_UInt64)0xa7c5,  /* nextThreshold */
    },
};

/* Module__diagsEnabled__C */
const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled__C __attribute__ ((section (".rodata_ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled__C")));
__FAR__ const CT__ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled ti_sysbios_family_arm_cc26xx_Timer_Module__diagsEnabled__C = (xdc_Bits32)0x90;

